# === ЭТАП 1: Сборка приложения ===
# Берем легкий официальный образ Node.js на базе Alpine Linux
FROM node:20-alpine AS builder

# Указываем рабочую директорию внутри контейнера
WORKDIR /app

# Сначала копируем ТОЛЬКО файлы зависимостей (для правильного кэширования слоев)
COPY package*.json ./

# Устанавливаем зависимости (чистая установка для CI/CD и Docker)
RUN npm ci

# Только после этого копируем весь остальной код проекта
COPY . .

# Запускаем сборку (на выходе получим папку dist с HTML/CSS/JS)
RUN npm run build


# === ЭТАП 2: Запуск на веб-сервере Nginx ===
# Берем супер-легкий образ Nginx (весит около 20 МБ)
FROM nginx:stable-alpine

# Копируем собранные статические файлы из предыдущего этапа (builder) 
# в папку, откуда Nginx по умолчанию раздает статику
COPY --from=builder /app/dist /usr/share/nginx/html

# Открываем 80 порт наружу
EXPOSE 80

# Запускаем Nginx (команда по умолчанию для этого образа)
CMD ["nginx", "-g", "daemon off;"]